Repository: oldbay/RESTdeploy
Catalog: client/deploy_rest_client/i18n/*/LC_MESSAGES/client.po
Languages: ru

source: Position N {}
ru: Позиция № {}

source: Create new login and password to client
ru: Создать новый логин и пароль для пользователя клиента

source: Update password to server dataase for auth user
ru: Обновить пароль в базе данных сервера для пользователя

source: Info from all jobs
ru: Информация о всех заданиях

source: Set user login
ru: Указать логин пользователя

source: Set user password
ru: Указать пароль пользователя

source: Set job number for info in base of auth user
ru: Указать номер задания для принадлежащего авторизованному пользователю

source: REST ERR: Server not available
ru: REST ERR: Сервер не доступен

source: REST OK: Login and password added
ru: REST OK: Логин и пароль добавлены

source: REST ERR {}: Create user false
ru: REST ERR {}: Ошбка создания пользователя

source: REST OK: Password update
ru: REST OK: Пароль обновлён

source: REST ERR {}: Authorization failed
ru: REST ERR {}: Ошибка авторизации

source: REST ERR {}: Password update failed
ru: REST ERR {}: Ошибка обновления пароля

source: User name and password not found, authorization please
ru: Имя пользователя и пароль не обнаружены, пожалуйста авторизуйтесь

source: REST ERR {}: Request error
ru: REST ERR {}: Ошибка запроса

source: Please select: Create(-C) or Update(-U) or Info(-I) only
ru: Пожалуйста используйте только: Create(-C) or Update(-U) or Info(-I)

source: Get info from all jobs
ru: Получить информацию о всех заданиях

source: Get info from all sources
ru: Получить информацию о всех исходниках

source: Get info from all packages
ru: Получить информацию о всех пакетах

source: Get verbose info
ru: Дать подробную информация

source: Please select: Jobs(-J) or Sources(-S) or Packages(-P) only
ru: Пожалуйста используйте только: Jobs(-J) or Sources(-S) or Packages(-P)

source: Create new source from git clone or update
ru: Создание или обновление каталога исходников

source: Delete source catalog and packages derictories
ru: Удаление каталогов исходников и пакетов

source: Version info from this source
ru: Информация о версиях данных исходников

source: Set name as git link or source name
ru: Задать имя программы или git ссылки

source: REST OK: Task queued
ru: REST OK: Задание добавлено в очередь

source: Please select: Create(-C) or Delete(-D) or Info(-I) only and use name(-n)
ru: Пожалуйста используйте только: Create(-C) or Delete(-D) or Info(-I) при указании name(-n)

source: Build packages from name, version and digit
ru: Сборка пакетов по имени, версии и разрядности

source: Delete all file from name, digit (and version)
ru: Удалить все файлы по имени, разрядности (и версии)

source: Files info from name, version and digit
ru: Информация о файлах по имени программы, версии и разрядности

source: File view from file name, version and digit
ru: Просмотр файла по имени файла, имени программы, версии и разрядности

source: Set programm name
ru: Задать имя программы

source: Set programm version
ru: Задать версию программы

source: Set programm digit
ru: Задать разрядность программы

source: REST ERR {_state}: File {_file} not found
ru: REST ERR {_state}: Файл {_file} не обнаружен

source: REST ERR POST {}: Request error
ru: REST ERR POST {}: Ошибка запроса

source: ERR: File {} not log - not view
ru: ERR: Файл {} не является логом - нет просмотра

source: REST ERR GET {}: Request error
ru: REST ERR GET {}: Ошибка запроса

source: Please select: Build(-B) or Delete(-D) or Info(-I) or File(-F)
ru: Пожалуйста выберете: Build(-B) or Delete(-D) or Info(-I) or File(-F)

source: not valid comm string parameters please use: client.py user -h client.py info -h client.py src -h client.py pkg -h
ru: неправильные параметры командной строки пожалйста используйте: client.py user -h client.py info -h client.py src -h client.py pkg -h

source: Name
ru: Имя

source: Version
ru: Версия

source: Architecture
ru: Архитектура

source: Digit
ru: Разрядность

source: Programm name
ru: Имя программы

source: File name
ru: Имя файла

source: File type
ru: Тип файла

source: Command string
ru: Командная строка

source: Log
ru: Лог

source: Job
ru: Задание

source: Jobs
ru: Задания

source: Queue
ru: Очередь

source: Status complit
ru: Статус выполнения

source: List Sources
ru: Список исходников

source: List Files
ru: Список файлов
